SELECT ЧЛВК_ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО, "Средняя оценка" FROM Н_ЛЮДИ 
JOIN (
	SELECT Н_ВЕДОМОСТИ.ЧЛВК_ИД, AVG(CAST (ОЦЕНКА AS INTEGER)) "Средняя оценка" FROM Н_ВЕДОМОСТИ
	JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
	WHERE Н_ВЕДОМОСТИ.ОЦЕНКА NOT IN ('зачет', 'незач', 'осв', 'неявка')
	AND Н_УЧЕНИКИ.ГРУППА = '4100'
	GROUP BY Н_ВЕДОМОСТИ.ЧЛВК_ИД
) ON ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE "Средняя оценка" <= (
	SELECT AVG(CAST (ОЦЕНКА AS INTEGER)) FROM Н_ВЕДОМОСТИ
	JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
	WHERE Н_УЧЕНИКИ.ГРУППА = '1100'
	AND ОЦЕНКА NOT IN ('зачет', 'незач', 'осв', 'неявка')
	GROUP BY Н_УЧЕНИКИ.ГРУППА
);
